app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 14 Feb 2014 21:43:49 UTC +00:00], ["name", "sid"], ["password", "sid"], ["updated_at", Fri, 14 Feb 2014 21:43:49 UTC +00:00]]
---
  	def create
    	@user = User.add(params[:name], params[:password])
    	if @user.save